Public Member Functions | Protected Member Functions | Friends | List of all members
ACAPI::Element::ModifiableOpeningFloorPlanParameters Class Referencefinal
Element Manager
#include <OpeningFloorPlanParameters.hpp>
 Inheritance diagram for ACAPI::Element::ModifiableOpeningFloorPlanParameters:
 Public Member Functions
void  | SetFloorPlanDisplayMode (OpeningFloorPlanDisplayMode value)
set the floorplan display mode of the opening(default).
void  | SetDividedOpeningMode (DividedOpeningMode value)
set divided opening mode of the opening(default).
 void  | UseCutSurfacesLineOfCutElementsOn ()
the cut line type of the cut element is used for cut surfaces
 void  | UseCutSurfacesLineOfCutElementsOff ()
the openings own cut line type is used for cut surfaces
void  | SetCutSurfacesLineIndex (const API_AttributeIndex &value)
set the cut line type
void  | SetCutSurfacesLinePenIndex (short value)
set the cut line pen index
void  | SetOpenEdgeStyle (OpeningOpenEdgeStyle value)
set the open edge style
 void  | UseOutlinesLineOfCutElementsOn ()
the uncut line type of the cut element is used for cut surfaces
 void  | UseOutlinesLineOfCutElementsOff ()
the openings own uncut line type is used for cut surfaces
void  | SetOutlinesUncutLineIndex (const API_AttributeIndex &value)
set the uncut line type
void  | SetOutlinesUncutLinePenIndex (short value)
set the uncut line pen index
void  | SetOutlinesOverheadLineIndex (const API_AttributeIndex &value)
set the overhead line type
void  | SetOutlinesOverheadLinePenIndex (short value)
set the overhead line pen index
 void  | UseCoverFillsOn ()
turn on cover fill
 void  | UseCoverFillsOff ()
turn off cover fill
 void  | UseCoverFillsOfCutElementsOn ()
use the cover fill of the cut element
 void  | UseCoverFillsOfCutElementsOff ()
use the openings own cover fill
void  | SetCoverFillsIndex (const API_AttributeIndex &value)
set the cover fill type
void  | SetCoverFillsPenIndex (short value)
set the cover fill foreground pen index
void  | SetCoverFillsBackgroundPenIndex (short value)
set the cover fill background pen index
Result< void >  | SetCoverFillOrientation (API_HatchOrientationTypeID value)
set the cover fill orientation type
Result< void >  | SetCoverFillTransformation (const API_CoverFillTransformation &value)
set the cover fill trasformation
 void  | ShowReferenceAxisOn ()
turn on reference axis
 void  | ShowReferenceAxisOff ()
turn off reference axis
void  | SetReferenceAxisLineTypeIndex (const API_AttributeIndex &value)
set the reference axis line type
void  | SetReferenceAxisPenIndex (short value)
set the reference axis line pen index
void  | SetReferenceAxisOverhang (double value)
set the reference axis overhang
Result< void >  | SetCutSymbol (const API_Guid &libPartId)
Changes the cut symbol of OpeningFloorPlanParameters.
Result< void >  | SetCutSymbolParameters (const GDL::Parameters &gdlParams)
Changes the gdl parameters of the cut symbol of OpeningFloorPlanParameters.
Result< void >  | ClearCutSymbol ()
Clears the cut symbol of OpeningFloorPlanParameters.
Result< void >  | SetUnCutSymbol (const API_Guid &libPartId)
Changes the uncut symbol of OpeningFloorPlanParameters.
Result< void >  | SetUnCutSymbolParameters (const GDL::Parameters &gdlParams)
Changes the gdl parameters of the uncut symbol of OpeningFloorPlanParameters.
Result< void >  | ClearUnCutSymbol ()
Clears the uncut symbol of OpeningFloorPlanParameters.
 Public Member Functions inherited from ACAPI::Element::OpeningFloorPlanParameters
OpeningFloorPlanDisplayMode  | GetFloorPlanDisplayMode () const
DividedOpeningMode  | GetDividedOpeningMode () const
bool  | IsCutSurfacesUseLineOfCutElements () const
API_AttributeIndex  | GetCutSurfacesLineIndex () const
short  | GetCutSurfacesLinePenIndex () const
OpeningOpenEdgeStyle  | GetOpenEdgeStyle () const
bool  | IsOutlinesUseLineOfCutElements () const
API_AttributeIndex  | GetOutlinesUncutLineIndex () const
short  | GetOutlinesUncutLinePenIndex () const
API_AttributeIndex  | GetOutlinesOverheadLineIndex () const
short  | GetOutlinesOverheadLinePenIndex () const
bool  | GetUseCoverFills () const
bool  | IsCoverFillsUseFillsOfCutElements () const
API_AttributeIndex  | GetCoverFillsIndex () const
short  | GetCoverFillsPenIndex () const
short  | GetCoverFillsBackgroundPenIndex () const
API_HatchOrientationTypeID  | GetCoverFillOrientation () const
std::optional< API_CoverFillTransformation >  | GetCoverFillTransformation () const
bool  | IsShowReferenceAxis () const
API_AttributeIndex  | GetReferenceAxisLineTypeIndex () const
short  | GetReferenceAxisPenIndex () const
double  | GetReferenceAxisOverhang () const
bool  | HasCutSymbol () const
std::optional< API_Guid >  | GetCutSymbolLibpartId () const
std::optional< GDL::Parameters >  | GetCutSymbolParameters () const
bool  | HasUnCutSymbol () const
std::optional< API_Guid >  | GetUnCutSymbolLibpartId () const
std::optional< GDL::Parameters >  | GetUnCutSymbolParameters () const
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
ModifiableOpeningFloorPlanParameters (std::shared_ptr< Impl::OpeningFloorPlanParametersBase > impl)
Constructs an ModifiableOpeningFloorPlanParameters with an OpeningFloorPlanParameters implementation.
 Protected Member Functions inherited from ACAPI::Element::OpeningFloorPlanParameters
OpeningFloorPlanParameters (std::shared_ptr< Impl::OpeningFloorPlanParametersBase > impl)
Constructs an OpeningFloorPlanParameters with an OpeningFloorPlanParameters implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Friends
 class  | Opening
 class  | OpeningDefault
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
It represents the modifiable floorplan parameters of an Opening element or an OpeningDefault element.
Since
Archicad 29
Constructor & Destructor Documentation
◆ ModifiableOpeningFloorPlanParameters()
 ACAPI::Element::ModifiableOpeningFloorPlanParameters::ModifiableOpeningFloorPlanParameters  |  ( |  std::shared_ptr< Impl::OpeningFloorPlanParametersBase > |  impl | )
protected
Constructs an ModifiableOpeningFloorPlanParameters with an OpeningFloorPlanParameters implementation.
Parameters
impl | The OpeningFloorPlanParameters implementation.
Member Function Documentation
◆ ClearCutSymbol()
 Result< void > ACAPI::Element::ModifiableOpeningFloorPlanParameters::ClearCutSymbol  |  ( |   | )
Clears the cut symbol of OpeningFloorPlanParameters.
Returns
Returns error if failed, nothing otherwise
◆ ClearUnCutSymbol()
 Result< void > ACAPI::Element::ModifiableOpeningFloorPlanParameters::ClearUnCutSymbol  |  ( |   | )
Clears the uncut symbol of OpeningFloorPlanParameters.
Returns
Returns error if failed, nothing otherwise
◆ SetCoverFillOrientation()
 Result< void > ACAPI::Element::ModifiableOpeningFloorPlanParameters::SetCoverFillOrientation  |  ( |  API_HatchOrientationTypeID |  value | )
set the cover fill orientation type
Parameters
value | the new cover fill orientation type
Returns
Returns error if failed, nothing otherwise
Remarks
API_HatchCentered is not supported for opening(default)s
◆ SetCoverFillsBackgroundPenIndex()
 void ACAPI::Element::ModifiableOpeningFloorPlanParameters::SetCoverFillsBackgroundPenIndex  |  ( |  short |  value | )
set the cover fill background pen index
Parameters
value | the new cover fill background pen index
◆ SetCoverFillsIndex()
 void ACAPI::Element::ModifiableOpeningFloorPlanParameters::SetCoverFillsIndex  |  ( |  const API_AttributeIndex & |  value | )
set the cover fill type
Parameters
value | the new cover fill type
◆ SetCoverFillsPenIndex()
 void ACAPI::Element::ModifiableOpeningFloorPlanParameters::SetCoverFillsPenIndex  |  ( |  short |  value | )
set the cover fill foreground pen index
Parameters
value | the new cover fill foreground pen index
◆ SetCoverFillTransformation()
 Result< void > ACAPI::Element::ModifiableOpeningFloorPlanParameters::SetCoverFillTransformation  |  ( |  const API_CoverFillTransformation & |  value | )
set the cover fill trasformation
Parameters
value | the new cover trasformation
Returns
Returns error if failed, nothing otherwise
Remarks
Not supported for opening default
◆ SetCutSurfacesLineIndex()
 void ACAPI::Element::ModifiableOpeningFloorPlanParameters::SetCutSurfacesLineIndex  |  ( |  const API_AttributeIndex & |  value | )
set the cut line type
Parameters
value | the new cut line type
◆ SetCutSurfacesLinePenIndex()
 void ACAPI::Element::ModifiableOpeningFloorPlanParameters::SetCutSurfacesLinePenIndex  |  ( |  short |  value | )
set the cut line pen index
Parameters
value | the new cut line pen index
◆ SetCutSymbol()
 Result< void > ACAPI::Element::ModifiableOpeningFloorPlanParameters::SetCutSymbol  |  ( |  const API_Guid & |  libPartId | )
Changes the cut symbol of OpeningFloorPlanParameters.
Parameters
libPartId | the main guid of the library part, must be valid opening symbol library part
Returns
Returns error if failed, nothing otherwise
◆ SetCutSymbolParameters()
 Result< void > ACAPI::Element::ModifiableOpeningFloorPlanParameters::SetCutSymbolParameters  |  ( |  const GDL::Parameters & |  gdlParams | )
Changes the gdl parameters of the cut symbol of OpeningFloorPlanParameters.
Parameters
gdlParams | gdl parameters to set
Returns
Returns error if failed, nothing otherwise
◆ SetDividedOpeningMode()
 void ACAPI::Element::ModifiableOpeningFloorPlanParameters::SetDividedOpeningMode  |  ( |  DividedOpeningMode |  value | )
set divided opening mode of the opening(default).
Parameters
value | the new divided opening mode
◆ SetFloorPlanDisplayMode()
 void ACAPI::Element::ModifiableOpeningFloorPlanParameters::SetFloorPlanDisplayMode  |  ( |  OpeningFloorPlanDisplayMode |  value | )
set the floorplan display mode of the opening(default).
Parameters
value | the new floorplan display mode
◆ SetOpenEdgeStyle()
 void ACAPI::Element::ModifiableOpeningFloorPlanParameters::SetOpenEdgeStyle  |  ( |  OpeningOpenEdgeStyle |  value | )
set the open edge style
Parameters
value | the new open edge style
◆ SetOutlinesOverheadLineIndex()
 void ACAPI::Element::ModifiableOpeningFloorPlanParameters::SetOutlinesOverheadLineIndex  |  ( |  const API_AttributeIndex & |  value | )
set the overhead line type
Parameters
value | the new overhead line type
◆ SetOutlinesOverheadLinePenIndex()
 void ACAPI::Element::ModifiableOpeningFloorPlanParameters::SetOutlinesOverheadLinePenIndex  |  ( |  short |  value | )
set the overhead line pen index
Parameters
value | the new overhead line pen index
◆ SetOutlinesUncutLineIndex()
 void ACAPI::Element::ModifiableOpeningFloorPlanParameters::SetOutlinesUncutLineIndex  |  ( |  const API_AttributeIndex & |  value | )
set the uncut line type
Parameters
value | the new uncut line type
◆ SetOutlinesUncutLinePenIndex()
 void ACAPI::Element::ModifiableOpeningFloorPlanParameters::SetOutlinesUncutLinePenIndex  |  ( |  short |  value | )
set the uncut line pen index
Parameters
value | the new uncut line pen index
◆ SetReferenceAxisLineTypeIndex()
 void ACAPI::Element::ModifiableOpeningFloorPlanParameters::SetReferenceAxisLineTypeIndex  |  ( |  const API_AttributeIndex & |  value | )
set the reference axis line type
Parameters
value | the new reference axis line type
◆ SetReferenceAxisOverhang()
 void ACAPI::Element::ModifiableOpeningFloorPlanParameters::SetReferenceAxisOverhang  |  ( |  double |  value | )
set the reference axis overhang
Parameters
value | the new reference axis overhang
◆ SetReferenceAxisPenIndex()
 void ACAPI::Element::ModifiableOpeningFloorPlanParameters::SetReferenceAxisPenIndex  |  ( |  short |  value | )
set the reference axis line pen index
Parameters
value | the new reference axis line pen index
◆ SetUnCutSymbol()
 Result< void > ACAPI::Element::ModifiableOpeningFloorPlanParameters::SetUnCutSymbol  |  ( |  const API_Guid & |  libPartId | )
Changes the uncut symbol of OpeningFloorPlanParameters.
Parameters
libPartId | the main guid of the library part, must be valid opening symbol library part
Returns
Returns error if failed, nothing otherwise
◆ SetUnCutSymbolParameters()
 Result< void > ACAPI::Element::ModifiableOpeningFloorPlanParameters::SetUnCutSymbolParameters  |  ( |  const GDL::Parameters & |  gdlParams | )
Changes the gdl parameters of the uncut symbol of OpeningFloorPlanParameters.
Parameters
gdlParams | gdl parameters to set
Returns
Returns error if failed, nothing otherwise